===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
UNet_v2                                       [1, 3, 64, 64]            --
├─DoubleConvolution: 1-1                      [1, 64, 64, 64]           --
│    └─Sequential: 2-1                        [1, 64, 64, 64]           --
│    │    └─Conv2d: 3-1                       [1, 64, 64, 64]           1,728
│    │    └─GroupNorm: 3-2                    [1, 64, 64, 64]           128
│    │    └─GELU: 3-3                         [1, 64, 64, 64]           --
│    │    └─Conv2d: 3-4                       [1, 64, 64, 64]           36,864
│    │    └─GroupNorm: 3-5                    [1, 64, 64, 64]           128
├─DownBlock: 1-2                              [1, 128, 32, 32]          --
│    └─Sequential: 2-2                        [1, 128, 32, 32]          --
│    │    └─MaxPool2d: 3-6                    [1, 64, 32, 32]           --
│    │    └─DoubleConvolution: 3-7            [1, 64, 32, 32]           73,984
│    │    └─DoubleConvolution: 3-8            [1, 128, 32, 32]          221,696
│    └─Sequential: 2-3                        [1, 128]                  --
│    │    └─SiLU: 3-9                         [1, 256]                  --
│    │    └─Linear: 3-10                      [1, 128]                  32,896
├─SelfAttention: 1-3                          [1, 128, 32, 32]          --
│    └─LayerNorm: 2-4                         [1, 1024, 128]            256
│    └─MultiheadAttention: 2-5                [1, 1024, 128]            66,048
│    └─Sequential: 2-6                        [1, 1024, 128]            --
│    │    └─LayerNorm: 3-11                   [1, 1024, 128]            256
│    │    └─Linear: 3-12                      [1, 1024, 128]            16,512
│    │    └─GELU: 3-13                        [1, 1024, 128]            --
│    │    └─Linear: 3-14                      [1, 1024, 128]            16,512
├─DownBlock: 1-4                              [1, 256, 16, 16]          --
│    └─Sequential: 2-7                        [1, 256, 16, 16]          --
│    │    └─MaxPool2d: 3-15                   [1, 128, 16, 16]          --
│    │    └─DoubleConvolution: 3-16           [1, 128, 16, 16]          295,424
│    │    └─DoubleConvolution: 3-17           [1, 256, 16, 16]          885,760
│    └─Sequential: 2-8                        [1, 256]                  --
│    │    └─SiLU: 3-18                        [1, 256]                  --
│    │    └─Linear: 3-19                      [1, 256]                  65,792
├─SelfAttention: 1-5                          [1, 256, 16, 16]          --
│    └─LayerNorm: 2-9                         [1, 256, 256]             512
│    └─MultiheadAttention: 2-10               [1, 256, 256]             263,168
│    └─Sequential: 2-11                       [1, 256, 256]             --
│    │    └─LayerNorm: 3-20                   [1, 256, 256]             512
│    │    └─Linear: 3-21                      [1, 256, 256]             65,792
│    │    └─GELU: 3-22                        [1, 256, 256]             --
│    │    └─Linear: 3-23                      [1, 256, 256]             65,792
├─DownBlock: 1-6                              [1, 512, 8, 8]            --
│    └─Sequential: 2-12                       [1, 512, 8, 8]            --
│    │    └─MaxPool2d: 3-24                   [1, 256, 8, 8]            --
│    │    └─DoubleConvolution: 3-25           [1, 256, 8, 8]            1,180,672
│    │    └─DoubleConvolution: 3-26           [1, 512, 8, 8]            3,540,992
│    └─Sequential: 2-13                       [1, 512]                  --
│    │    └─SiLU: 3-27                        [1, 256]                  --
│    │    └─Linear: 3-28                      [1, 512]                  131,584
├─SelfAttention: 1-7                          [1, 512, 8, 8]            --
│    └─LayerNorm: 2-14                        [1, 64, 512]              1,024
│    └─MultiheadAttention: 2-15               [1, 64, 512]              1,050,624
│    └─Sequential: 2-16                       [1, 64, 512]              --
│    │    └─LayerNorm: 3-29                   [1, 64, 512]              1,024
│    │    └─Linear: 3-30                      [1, 64, 512]              262,656
│    │    └─GELU: 3-31                        [1, 64, 512]              --
│    │    └─Linear: 3-32                      [1, 64, 512]              262,656
├─DownBlock: 1-8                              [1, 512, 4, 4]            --
│    └─Sequential: 2-17                       [1, 512, 4, 4]            --
│    │    └─MaxPool2d: 3-33                   [1, 512, 4, 4]            --
│    │    └─DoubleConvolution: 3-34           [1, 512, 4, 4]            4,720,640
│    │    └─DoubleConvolution: 3-35           [1, 512, 4, 4]            4,720,640
│    └─Sequential: 2-18                       [1, 512]                  --
│    │    └─SiLU: 3-36                        [1, 256]                  --
│    │    └─Linear: 3-37                      [1, 512]                  131,584
├─SelfAttention: 1-9                          [1, 512, 4, 4]            --
│    └─LayerNorm: 2-19                        [1, 16, 512]              1,024
│    └─MultiheadAttention: 2-20               [1, 16, 512]              1,050,624
│    └─Sequential: 2-21                       [1, 16, 512]              --
│    │    └─LayerNorm: 3-38                   [1, 16, 512]              1,024
│    │    └─Linear: 3-39                      [1, 16, 512]              262,656
│    │    └─GELU: 3-40                        [1, 16, 512]              --
│    │    └─Linear: 3-41                      [1, 16, 512]              262,656
├─DoubleConvolution: 1-10                     [1, 1024, 4, 4]           --
│    └─Sequential: 2-22                       [1, 1024, 4, 4]           --
│    │    └─Conv2d: 3-42                      [1, 1024, 4, 4]           4,718,592
│    │    └─GroupNorm: 3-43                   [1, 1024, 4, 4]           2,048
│    │    └─GELU: 3-44                        [1, 1024, 4, 4]           --
│    │    └─Conv2d: 3-45                      [1, 1024, 4, 4]           9,437,184
│    │    └─GroupNorm: 3-46                   [1, 1024, 4, 4]           2,048
├─DoubleConvolution: 1-11                     [1, 1024, 4, 4]           --
│    └─Sequential: 2-23                       [1, 1024, 4, 4]           --
│    │    └─Conv2d: 3-47                      [1, 1024, 4, 4]           9,437,184
│    │    └─GroupNorm: 3-48                   [1, 1024, 4, 4]           2,048
│    │    └─GELU: 3-49                        [1, 1024, 4, 4]           --
│    │    └─Conv2d: 3-50                      [1, 1024, 4, 4]           9,437,184
│    │    └─GroupNorm: 3-51                   [1, 1024, 4, 4]           2,048
├─DoubleConvolution: 1-12                     [1, 512, 4, 4]            --
│    └─Sequential: 2-24                       [1, 512, 4, 4]            --
│    │    └─Conv2d: 3-52                      [1, 512, 4, 4]            4,718,592
│    │    └─GroupNorm: 3-53                   [1, 512, 4, 4]            1,024
│    │    └─GELU: 3-54                        [1, 512, 4, 4]            --
│    │    └─Conv2d: 3-55                      [1, 512, 4, 4]            2,359,296
│    │    └─GroupNorm: 3-56                   [1, 512, 4, 4]            1,024
├─UpBlock: 1-13                               [1, 256, 8, 8]            --
│    └─Upsample: 2-25                         [1, 512, 8, 8]            --
│    └─Sequential: 2-26                       [1, 256, 8, 8]            --
│    │    └─DoubleConvolution: 3-57           [1, 1024, 8, 8]           18,878,464
│    │    └─DoubleConvolution: 3-58           [1, 256, 8, 8]            5,899,776
│    └─Sequential: 2-27                       [1, 256]                  --
│    │    └─SiLU: 3-59                        [1, 256]                  --
│    │    └─Linear: 3-60                      [1, 256]                  65,792
├─SelfAttention: 1-14                         [1, 256, 8, 8]            --
│    └─LayerNorm: 2-28                        [1, 64, 256]              512
│    └─MultiheadAttention: 2-29               [1, 64, 256]              263,168
│    └─Sequential: 2-30                       [1, 64, 256]              --
│    │    └─LayerNorm: 3-61                   [1, 64, 256]              512
│    │    └─Linear: 3-62                      [1, 64, 256]              65,792
│    │    └─GELU: 3-63                        [1, 64, 256]              --
│    │    └─Linear: 3-64                      [1, 64, 256]              65,792
├─UpBlock: 1-15                               [1, 128, 16, 16]          --
│    └─Upsample: 2-31                         [1, 256, 16, 16]          --
│    └─Sequential: 2-32                       [1, 128, 16, 16]          --
│    │    └─DoubleConvolution: 3-65           [1, 512, 16, 16]          4,720,640
│    │    └─DoubleConvolution: 3-66           [1, 128, 16, 16]          1,475,328
│    └─Sequential: 2-33                       [1, 128]                  --
│    │    └─SiLU: 3-67                        [1, 256]                  --
│    │    └─Linear: 3-68                      [1, 128]                  32,896
├─SelfAttention: 1-16                         [1, 128, 16, 16]          --
│    └─LayerNorm: 2-34                        [1, 256, 128]             256
│    └─MultiheadAttention: 2-35               [1, 256, 128]             66,048
│    └─Sequential: 2-36                       [1, 256, 128]             --
│    │    └─LayerNorm: 3-69                   [1, 256, 128]             256
│    │    └─Linear: 3-70                      [1, 256, 128]             16,512
│    │    └─GELU: 3-71                        [1, 256, 128]             --
│    │    └─Linear: 3-72                      [1, 256, 128]             16,512
├─UpBlock: 1-17                               [1, 64, 32, 32]           --
│    └─Upsample: 2-37                         [1, 128, 32, 32]          --
│    └─Sequential: 2-38                       [1, 64, 32, 32]           --
│    │    └─DoubleConvolution: 3-73           [1, 256, 32, 32]          1,180,672
│    │    └─DoubleConvolution: 3-74           [1, 64, 32, 32]           369,024
│    └─Sequential: 2-39                       [1, 64]                   --
│    │    └─SiLU: 3-75                        [1, 256]                  --
│    │    └─Linear: 3-76                      [1, 64]                   16,448
├─SelfAttention: 1-18                         [1, 64, 32, 32]           --
│    └─LayerNorm: 2-40                        [1, 1024, 64]             128
│    └─MultiheadAttention: 2-41               [1, 1024, 64]             16,640
│    └─Sequential: 2-42                       [1, 1024, 64]             --
│    │    └─LayerNorm: 3-77                   [1, 1024, 64]             128
│    │    └─Linear: 3-78                      [1, 1024, 64]             4,160
│    │    └─GELU: 3-79                        [1, 1024, 64]             --
│    │    └─Linear: 3-80                      [1, 1024, 64]             4,160
├─UpBlock: 1-19                               [1, 64, 64, 64]           --
│    └─Upsample: 2-43                         [1, 64, 64, 64]           --
│    └─Sequential: 2-44                       [1, 64, 64, 64]           --
│    │    └─DoubleConvolution: 3-81           [1, 128, 64, 64]          295,424
│    │    └─DoubleConvolution: 3-82           [1, 64, 64, 64]           110,848
│    └─Sequential: 2-45                       [1, 64]                   --
│    │    └─SiLU: 3-83                        [1, 256]                  --
│    │    └─Linear: 3-84                      [1, 64]                   16,448
├─SelfAttention: 1-20                         [1, 64, 64, 64]           --
│    └─LayerNorm: 2-46                        [1, 4096, 64]             128
│    └─MultiheadAttention: 2-47               [1, 4096, 64]             16,640
│    └─Sequential: 2-48                       [1, 4096, 64]             --
│    │    └─LayerNorm: 3-85                   [1, 4096, 64]             128
│    │    └─Linear: 3-86                      [1, 4096, 64]             4,160
│    │    └─GELU: 3-87                        [1, 4096, 64]             --
│    │    └─Linear: 3-88                      [1, 4096, 64]             4,160
├─Conv2d: 1-21                                [1, 3, 64, 64]            195
===============================================================================================
Total params: 93,417,859
Trainable params: 93,417,859
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 8.28
===============================================================================================
Input size (MB): 0.05
Forward/backward pass size (MB): 86.36
Params size (MB): 362.50
Estimated Total Size (MB): 448.91
===============================================================================================
Total epochs: 10000
Denoising steps: 1000
Max learning rate: 0.0001
Variance schedule type: linear
Beta start: 0.0001
Beta end: 0.02
Embedding dimension: 256
Number of attention heads: 1
Batch size: 29
Num workers: 2
Additional note: 